In [59]:
#importing dependencies
import pandas as pd
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine
from sqlalchemy import func
import pymysql
import numpy as np
import math
import statistics
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
pymysql.install_as_MySQLdb()

engine = create_engine("mysql://root:Henry8354392.@localhost/ETLProject")
conn = engine.connect()

In [17]:
#university into json into a dataframe
university = "schoolInfo.json"

universitydf=pd.read_json(university)

universitydf.head()

,acceptance-rate,act-avg,aliasNames,businessRepScore,city,cost-after-aid,displayName,engineeringRepScore,enrollment,hs-gpa-avg,...,rankingType,region,sat-avg,schoolType,sortName,state,tuition,urlName,xwalkId,zip
0,7.0,32.0,None,NaN,Princeton,16793.0,Princeton University,4.1,5400.0,3.9,...,national-universities,NaN,1400.0,national-universities,princetonuniversity,NJ,47140,princeton-university,186131,8544
1,5.0,32.0,None,NaN,Cambridge,16338.0,Harvard University,3.6,6710.0,4.0,...,national-universities,NaN,1430.0,national-universities,harvarduniversity,MA,48949,harvard-university,166027,2138
2,8.0,32.0,UChicago,NaN,Chicago,27767.0,University of Chicago,NaN,5941.0,4.0,...,national-universities,NaN,1450.0,national-universities,universityofchicago,IL,54825,university-of-chicago,144050,60637
3,6.0,32.0,None,NaN,New Haven,18385.0,Yale University,3.4,5472.0,NaN,...,national-universities,NaN,1420.0,national-universities,yaleuniversity,CT,51400,yale-university,130794,6520
4,6.0,32.0,None,NaN,New York,21041.0,Columbia University,3.8,6113.0,NaN,...,national-universities,NaN,1430.0,national-universities,columbiauniversity,NY,57208,columbia-university,190150,10027

In [27]:
#cleaning dataframe
universitydf_clean= universitydf[['displayName','city','state','hs-gpa-avg','sat-avg']].copy()
universitydf_clean = universitydf_clean.rename(columns={'displayName': "School Name", "hs-gpa-avg": "High School GPA",
                                                        'sat-avg': "SAT Average", 'city': "City", 'state': "State"})
universitydf_clean.head()

             School Name       City State  High School GPA  SAT Average
0   Princeton University  Princeton    NJ              3.9       1400.0
1     Harvard University  Cambridge    MA              4.0       1430.0
2  University of Chicago    Chicago    IL              4.0       1450.0
3        Yale University  New Haven    CT              NaN       1420.0
4    Columbia University   New York    NY              NaN       1430.0

In [28]:
salaries_df = pd.read_csv('salaries-by-region.csv')
salaries_df.head()

,School Name,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Stanford University,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"
1,California Institute of Technology (CIT),California,"$75,500.00","$123,000.00",NaN,"$104,000.00","$161,000.00",NaN
2,Harvey Mudd College,California,"$71,800.00","$122,000.00",NaN,"$96,000.00","$180,000.00",NaN
3,"University of California, Berkeley",California,"$59,900.00","$112,000.00","$59,500.00","$81,000.00","$149,000.00","$201,000.00"
4,Occidental College,California,"$51,900.00","$105,000.00",NaN,"$54,800.00","$157,000.00",NaN

In [118]:
univ_sal_df = pd.merge(universitydf_clean, salaries_df, on = 'School Name', how = 'inner')
univ_sal_df.head(5)
#statistics.median(univ_sal_df["High School GPA"])

,School Name,City,State,High School GPA,SAT Average,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Princeton University,Princeton,NJ,3.9,1400.0,Northeastern,"$66,500.00","$131,000.00","$68,900.00","$100,000.00","$190,000.00","$261,000.00"
1,Harvard University,Cambridge,MA,4.0,1430.0,Northeastern,"$63,400.00","$124,000.00","$54,800.00","$86,200.00","$179,000.00","$288,000.00"
2,Yale University,New Haven,CT,NaN,1420.0,Northeastern,"$59,100.00","$126,000.00","$58,000.00","$80,600.00","$198,000.00","$326,000.00"
3,Columbia University,New York,NY,NaN,1430.0,Northeastern,"$59,400.00","$107,000.00","$50,300.00","$71,900.00","$161,000.00","$241,000.00"
4,Stanford University,Stanford,CA,NaN,1380.0,California,"$70,400.00","$129,000.00","$68,400.00","$93,100.00","$184,000.00","$257,000.00"

In [119]:
univ_sal_df["High School GPA"].median()
univ_sal_df["High School GPA"].fillna(3.6,inplace = True)

In [120]:
#test = univ_sal_df.loc(univ_sal_df["Mid-Career 90th Percentile Salary"] == 'NaN')
univ_sal_df["Starting Median Salary"] = univ_sal_df["Starting Median Salary"].str.replace("$",'')
univ_sal_df["Mid-Career Median Salary"] = univ_sal_df["Mid-Career Median Salary"].str.replace("$",'')
univ_sal_df["Mid-Career 10th Percentile Salary"] = univ_sal_df["Mid-Career 10th Percentile Salary"].str.replace("$",'')
univ_sal_df["Mid-Career 25th Percentile Salary"] = univ_sal_df["Mid-Career 25th Percentile Salary"].str.replace("$",'')
univ_sal_df["Mid-Career 75th Percentile Salary"] = univ_sal_df["Mid-Career 75th Percentile Salary"].str.replace("$",'')
univ_sal_df["Mid-Career 90th Percentile Salary"] = univ_sal_df["Mid-Career 90th Percentile Salary"].str.replace("$",'')
univ_sal_df["Starting Median Salary"] = univ_sal_df["Starting Median Salary"].str.replace(",",'')
univ_sal_df["Mid-Career Median Salary"] = univ_sal_df["Mid-Career Median Salary"].str.replace(",",'')
univ_sal_df["Mid-Career 10th Percentile Salary"] = univ_sal_df["Mid-Career 10th Percentile Salary"].str.replace(",",'')
univ_sal_df["Mid-Career 25th Percentile Salary"] = univ_sal_df["Mid-Career 25th Percentile Salary"].str.replace(",",'')
univ_sal_df["Mid-Career 75th Percentile Salary"] = univ_sal_df["Mid-Career 75th Percentile Salary"].str.replace(",",'')
univ_sal_df["Mid-Career 90th Percentile Salary"] = univ_sal_df["Mid-Career 90th Percentile Salary"].str.replace(",",'')
univ_sal_df["Starting Median Salary"] = pd.to_numeric(univ_sal_df["Starting Median Salary"])
univ_sal_df["Mid-Career 10th Percentile Salary"] = pd.to_numeric(univ_sal_df["Mid-Career 10th Percentile Salary"])
univ_sal_df["Mid-Career 25th Percentile Salary"] = pd.to_numeric(univ_sal_df["Mid-Career 25th Percentile Salary"])
univ_sal_df["Mid-Career 75th Percentile Salary"] = pd.to_numeric(univ_sal_df["Mid-Career 75th Percentile Salary"])
univ_sal_df["Mid-Career 90th Percentile Salary"] = pd.to_numeric(univ_sal_df["Mid-Career 90th Percentile Salary"])
univ_sal_df["Mid-Career Median Salary"] = pd.to_numeric(univ_sal_df["Mid-Career Median Salary"])

#,univ_sal_df["Mid-Career 10th Percentile Salary"]
#                            univ_sal_df["Mid-Career 25th Percentile Salary"], univ_sal_df["Mid-Career 75th Percentile Salary"],
#                            univ_sal_df["Mid-Career 90th Percentile Salary"], univ_sal_df["Mid-Career Median Salary"]])
univ_sal_df.head()

,School Name,City,State,High School GPA,SAT Average,Region,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 25th Percentile Salary,Mid-Career 75th Percentile Salary,Mid-Career 90th Percentile Salary
0,Princeton University,Princeton,NJ,3.9,1400.0,Northeastern,66500.0,131000.0,68900.0,100000.0,190000.0,261000.0
1,Harvard University,Cambridge,MA,4.0,1430.0,Northeastern,63400.0,124000.0,54800.0,86200.0,179000.0,288000.0
2,Yale University,New Haven,CT,3.6,1420.0,Northeastern,59100.0,126000.0,58000.0,80600.0,198000.0,326000.0
3,Columbia University,New York,NY,3.6,1430.0,Northeastern,59400.0,107000.0,50300.0,71900.0,161000.0,241000.0
4,Stanford University,Stanford,CA,3.6,1380.0,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0

In [125]:
univ_sal_df.dtypes
univ_sal_df = univ_sal_df.rename(columns={'School Name': "school_name", "High School GPA": "highschool_gpa",
                                          "SAT Average": "sat_avg", 'city': "City", 'state': "State", 
                                          "Starting Median Salary": "starting_meadian_salary", 
                                          "Mid-Career Median Salary": 'mid_career_salary', 
                                          "Mid-Career Median Salary": "mid_career_median_salary", 
                                         "Mid-Career 10th Percentile Salary": "mid_career_10th_percentile_salary",
                                          "Mid-Career 75th Percentile Salary": "mid_career_75th_percentile_salary",
                                          "Mid-Career 25th Percentile Salary": "mid_career_25th_percentile_salary",
                                          "Mid-Career 90th Percentile Salary": "mid_career_90th_percentile_salary"})
univ_sal_df.head()

,school_name,City,State,highschool_gpa,sat_avg,Region,starting_meadian_salary,mid_career_median_salary,mid_career_10th_percentile_salary,mid_career_25th_percentile_salary,mid_career_75th_percentile_salary,mid_career_90th_percentile_salary
0,Princeton University,Princeton,NJ,3.9,1400.0,Northeastern,66500.0,131000.0,68900.0,100000.0,190000.0,261000.0
1,Harvard University,Cambridge,MA,4.0,1430.0,Northeastern,63400.0,124000.0,54800.0,86200.0,179000.0,288000.0
2,Yale University,New Haven,CT,3.6,1420.0,Northeastern,59100.0,126000.0,58000.0,80600.0,198000.0,326000.0
3,Columbia University,New York,NY,3.6,1430.0,Northeastern,59400.0,107000.0,50300.0,71900.0,161000.0,241000.0
4,Stanford University,Stanford,CA,3.6,1380.0,California,70400.0,129000.0,68400.0,93100.0,184000.0,257000.0

In [127]:
univ_sal_df.to_csv("University.csv", sep='\t')
univ_sal_df.to_sql(name='University', con = engine, if_exists='replace',index = False)

C:\Users\dinhh\New folder\lib\site-packages\pandas\io\sql.py:1144: UserWarning: The provided table name 'University' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  warnings.warn(msg, UserWarning)

In [20]:
#joining dataframes
#statelist = pd.read_sql_query("Select * from state", con=engine)

#merged= universitydf_clean.merge(state_list, left_on="state", right_on="state_abbv", how='left')
merged_table = universitydf_clean.join()

merged_table.head()

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'etlproject.state' doesn't exist") [SQL: 'Select * from state'] (Background on this error at: http://sqlalche.me/e/f405)

In [32]:
#column dropping
merged.drop(columns={'state','state_name','state_abbv'}, inplace=True)

NameError: name 'merged' is not defined

In [33]:
#column renaming 
merged.rename(columns={'overallRank':'ranking_number'}, inplace=True)
merged.head()

NameError: name 'merged' is not defined

In [34]:
# inserting database 
merged.to_sql(name="college_list",con=engine,if_exists='append', index=False)

NameError: name 'merged' is not defined

In [ ]:
#database insertion
merged.to_sql(name="rankings",con=engine,if_exists='append', index=False)

In [ ]:
pd.read_sql_query("Select * from college_list", con=engine)

In [ ]:
#reading ranks
pd.read_sql_query("Select * from rankings", con=engine)

In [ ]:
#adding 2017 as the year
merged['ranking_year']='2017'
merged.head()